[
{"name": ["Fred Tichauer"], "job_title": ["Realtor"], "image_url": ["https://content.mediastg.net/dynamic/RealEstate/company/686/account/659767/659767_04052022192848.png"], "address": "331 Village Pointe Plaza", "contact_details": {"Office": "tel:402-679-3914"}, "social_accounts": {"facebook": "https://www.facebook.com/fntichauer", "twitter": "https://www.twitter.com/tichauer_fred", "linkedin": "https://linkedin.com/in/fred-tichauer-00182a13/", "youtube": "https://www.youtube.com/channel/UCQPbJBD9uS8n0aXoV6rIM2A", "pinterest": "https://www.pinterest.com/bhhsamb", "instagram": "https://www.instagram.com/fred_tichauer"}, "languages": ["Spanish"], "description": "In the Omaha metro area, Fred Tichauer is highly regarded for his unparalleled knowledge of residential real estate investment. In addition to being a long-time investor, he is an Associate Broker with Berkshire Hathaway Ambassador Real Estate. Fred teaches continuing education classed approved by the Nebraska Real Estate Commission. To date, more than 1100 Realtors in the Omaha metro area have enrolled in his courses, as well as hundreds more throughout the country. He takes a great deal of pride in the fact that many of his clients and former students are now millionaire real estate investors. With half a century of success as an investor, Fred understands the ins and outs of the investment niche market form the perspectives of the investor and agent. His proven system will push you to achieve your financial objectives. Fred holds himself to a high moral standard and would never encourage a client to purchase a property that he would not consider purchasing himself. Rather than focusing on his next commission check , Fred devotes his energy to helping his clients accomplish their financial goals. When you succeed, he succeeds. Throughout his long career, Fred has earned a reputation for being honest, straightforward, and providing only sound strategies that have worked for him. As his client or student, you can expect excellence, trust, commitment, integrity, leadership, practical knowledge, expertise, and results. As an a entrepreneur, Fred controls a sizable real estate portfolio generating a six-figure income. He has flipped more than 150 properties and coached clients to flip over 500. He believes there's nothing better than a real estate investment portfolio consisting of residential properties located in \"family-friendly\" neighborhoods. He is certain that anyone who is creditworthy and is willing to work hard can achieve the financial freedom they deserve. "}
]